{
  "name": "sequential_1",
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_1",
        "trainable": true,
        "batch_input_shape": [
          null,
          400,
          3
        ],
        "dtype": "float32",
        "filters": 32,
        "kernel_size": [
          21
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_1",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_1",
        "trainable": true,
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid"
      }
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_2",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          15
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_2",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_2",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_2",
        "trainable": true,
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid"
      }
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_3",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          11
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_3",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_3",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_3",
        "trainable": true,
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid"
      }
    },
    {
      "class_name": "Conv1D",
      "config": {
        "name": "conv1d_4",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          9
        ],
        "strides": [
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_4",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_4",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling1D",
      "config": {
        "name": "max_pooling1d_4",
        "trainable": true,
        "strides": [
          2
        ],
        "pool_size": [
          2
        ],
        "padding": "valid"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten_1",
        "trainable": true,
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "units": 200,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_5",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_5",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_2",
        "trainable": true,
        "units": 200,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_6",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_6",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_3",
        "trainable": true,
        "units": 3,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_7",
        "trainable": true,
        "activation": "softmax"
      }
    }
  ],
  "inbound_nodes": [
    [
      [
        "lambda_1",
        0,
        0,
        {}
      ]
    ],
    [
      [
        "lambda_2",
        0,
        0,
        {}
      ]
    ],
    [
      [
        "lambda_3",
        0,
        0,
        {}
      ]
    ]
  ]
}